[{"dateSent":"2017-12-07T09:05:34.447Z","sender":{"_id":"5a1f1bcf8bffa42e9c5c3e56","name":"Kasper Oesterbye","mail":"koe@cphbusiness.dk","imgUrl":"http://yousefmohsen.dk:4000/images/kasper.jpg","__v":0},"msg":"Dagens emner bliver:\nEn hurtig opsummering på hele semesteret, eksamens- form/spørgsmål, samt evaluering af semesteret\nEr der specielle spørgsmål/emner I gerne vil have opsummeret denne dag, send en besked, så jeg kan forberede mig.\nEvaluering kommer til at foregå via en beta-test af Jamie og Nikis' Delphi evaluerings system. Så, gør Jamie, Nikki, mig samt fremtidige studerende en tjeneste, og mød op denne dag.\nTjek jeres study-points inden fredag. For de fleste af jer ser det fint ud, for nogle få af jer, er I dog kritisk bagud. For jer må vi lægge en plan for de manglende afleveringer på fredag.\nMange hilsner\n","title":"Fredag d. 1 December, er årets sidste JavaScript dag","_id":"5a29045e139fc8367e5ef564"},{"dateSent":"2017-12-07T09:07:02.779Z","sender":{"_id":"5a1f1bcf8bffa42e9c5c3e56","name":"Kasper Oesterbye","mail":"koe@cphbusiness.dk","imgUrl":"http://yousefmohsen.dk:4000/images/kasper.jpg","__v":0},"msg":"Hej alle\nSå er læringsmål og opgaver klar for hele periode-4\nDe to sidste dage af perioden er afsat til at færdigøre det miniprojekt I skal vælge/starte på onsdag.\nFør I går helt i koma, så læs venligst ordet mini, før projekt ;-) Dette er ikke et projekt, bare i nærheden af hvad I laver i de andre fag, men en opgave der strækker sig over nogle dage, for at gøre den mere realistisk.\nFor denne del er der tre muligheder:\nFriend Finder:\nEn simpel Friend-finder app, der finder og viser ens venner, inden for en givet radius. Indeholder React Native, node/Express/Mongo/Mongoose + nogle spændende location features i Mongo.\nI vil få lidt undervisning/hjælp, til at få lavet jeres backend her.\nGraphQL:         \nReact Native med en GrapQL (graphcool) backend. Selve ideen bestemmer I selv.\nSelvvalgt:        \nVælg selv en opgave/idé. SKAL godkendes, og læringsmål formuleres, inden I starter\nMange hilsner\n \n\n","title":"Faget student for students","_id":"5a2904b6139fc8367e5ef565"},{"dateSent":"2017-12-07T09:08:19.888Z","sender":{"_id":"5a1f1bcf8bffa42e9c5c3e56","name":"Kasper Oesterbye","mail":"koe@cphbusiness.dk","imgUrl":"http://yousefmohsen.dk:4000/images/kasper.jpg","__v":0},"msg":"Hej alle\nGithub (følg link fra moodle) er opdateret med næsten færdig plan for periode-3.\nVigtigst er, at I ikke kommer uforberedte til fredags-lektionen, så tjek sektionen \"Before this lesson you should do\"\n\n","title":"Periode-3","_id":"5a290503139fc8367e5ef567"},{"dateSent":"2017-12-07T09:10:04.968Z","sender":{"_id":"5a1f1bcf8bffa42e9c5c3e56","name":"Kasper Oesterbye","mail":"koe@cphbusiness.dk","imgUrl":"http://yousefmohsen.dk:4000/images/kasper.jpg","__v":0},"msg":"Her alle\nHer en hurtig opsummering på ændringer vi aftalte i klassen i går (onsdag d. 13)\n•\tSkema ændres, så vi inddrager flere fredage tidligt, men så til gengæld har sidste lektion 1/12. \n•\tNoSQL + Security nedtones i forhold til oprindeligt oplæg \n•\tGraphQL kommer nu med som et separat periode-emne \nJeg ændrer snarest muligt TimeEdit, Periode-2 læringsmål, samt Moodle med disse ændringer. Indtil da, brug dette dokument for at se skema\nMange hilsner\n\n","title":"Ændringer i pensum","_id":"5a29056c139fc8367e5ef568"}]